import streamlit as st 

   
st.set_page_config(layout="wide", page_title="Hallo cat", page_icon=":tada:",
                   initial_sidebar_state="expanded", menu_items={
                       "About": "This is my app."
                   })


banner = st.image("cat.png")

def cats1():
    import streamlit as st

    st.sidebar.success("คลิก ด้านบนเพื่อดูเพิ่มเติม.")
    st.title("10 เรื่องน่ารู้เกี่ยวกับแมวเหมียว ")
    st.markdown("""
    ทาสแมวมือใหม่คงมีคำถามแมว ๆ อยู่ในใจกันมากมาย แต่ไม่ต้องกังวล! ข้อมูลแมวและเรื่องน่ารู้เกี่ยวกับแมวต่อไปนี้ จะช่วยไขข้อสงสัยของคุณได้
    """)
    st.markdown("------------------------------------------------------------------------------------------------------------------------")
    st.header("1. แมวมี9ชิวิตจริงไหม")
    st.markdown("""

    แมวมี 9 ชีวิตจริงไหม? เป็นคำถามแมว ๆ ที่ถูกถามบ่อย มันไม่เพียงแต่สร้างความลึกลับน่าค้นหา แต่ยังสร้างความนิยมอย่างมากให้กับเจ้าเหมียว ทั้งนี้แมวมี 9 ชีวิตเป็นเพียงความเชื่อ พวกเค้าแค่ดูแลง่ายและมักมีสุขภาพดี หากได้กินอาหารที่ดี ไม่เครียด และไม่มีโรคร้าย ก็อาจอยู่ได้นาน 15 – 21 ปีเลย

    """)

    st.header("2. ทำไมแมวชอบส่งเสียง “เพอร์” ?")
    st.markdown("""มีการคาดเดาข้อมูลแมวเกี่ยวกับการร้อง “เมี้ยว” หรือ “เพอร์” ค่อนข้างมาก แม้ว่าทั้งสองเสียงจะพบได้บ่อยเหมือนกัน แต่เสียง “เพอร์” เป็นเสียงครางในลำคอไม่ใช่การเปล่งเสียงอย่างการร้องเมี้ยว แมวเหมียวจะส่งเสียงเพอร์เมื่อมีความสุข หรือเมื่อรู้สึกไม่สบายตัว และเมื่อต้องการบอกรักทาสแมวคนโปรด เหมือนที่ลูกแมวทำกับแม่แมวนั่นเอง""")

    st.header("3. แมวไม่ชอบน้ำจริงไหม?")
    st.markdown("แมวไม่ชอบอาบน้ำเป็นปัญหาที่พบบ่อย ซึ่งพฤติกรรมแมวเกลียดน้ำนี้ เชื่อว่าเป็นผลจากอดีตที่แมวอาศัยในพื้นที่แห้งแล้ง จึงไม่คุ้นเคยและมักหลีกเลี่ยงแหล่งน้ำ แต่ไม่ใช่แมวทั้งหมดที่เกลียดน้ำ แมวบางสายพันธุ์ก็ชอบเล่นน้ำเป็นที่สุด เช่น เทอร์คิช แองโกรา, เมนคูน, เบงกอล และนอร์วีเจียน ฟอเรสต์")

    st.header("4. ทำไมแมวชอบกล่องลัง?")
    st.markdown("ถึงขนาดตัวจะเล็ก แต่แมวก็อยู่รอดมาได้เพราะความเฉลียวฉลาด พวกเค้าชอบอยู่ในพื้นที่ปิดเล็ก ๆ เพื่อหลบซ่อนจากภัยธรรมชาติและนักล่าในป่า แม้จะกลายเป็นแมวบ้านแล้ว แต่สัญชาตญาณยังคงอยู่ สังเกตได้จากพฤติกรรมแมวที่ชอบนั่งในกล่อง เพราะทำให้รู้สึกปลอดภัย แถมยังเป็นที่ซ่อนเพื่อซุ่มโจมตีที่ดีอีกด้วย")

    st.header("5. ทำไมแมวชอบแคทนิป?")
    cat2 = st.image("cat2.png")
    st.markdown("เป็นที่รู้กันดีว่าแมวส่วนใหญ่ชอบถูไถ เลีย และเคี้ยวแคทนิปมาก นั่นเพราะมันมีสารเนเปทาแลคโตน ซึ่งเมื่อสูดดมเข้าไป เซลล์รับกลิ่นจะส่งสัญญาณไปยังสมอง ทำให้พฤติกรรมแมวแปลกไป แต่สารชนิดนี้ไม่เป็นอันตราย ทาสแมวจึงสามารถหาของเล่นแคทนิปมาเอาใจเจ้าเหมียวกันได้แบบไร้กังวล")
    
    st.header("6. ทำไมแมวจึงเอาขาลงพื้นได้ทุกครั้งเมื่อตกจากที่สูง?")
    st.markdown("เนื่องจากสัญชาตญาณที่เรียกว่า “ปฏิกิริยาตอบสนอง” ทำให้แมวสามารถจัดระเบียบร่างกายขณะลอยตัวในอากาศ และปรับท่าทางลงสู่พื้นได้อย่างปลอดภัย อีกหนึ่งข้อมูลแมวที่น่าสนใจคือ อุ้งเท้าของแมวช่วยลดแรงกระแทกได้ โอกาสบาดเจ็บและเสียชีวิตเพราะตกจากที่สูงจึงน้อยลง จนเป็นสาเหตุของความเชื่อที่ว่าแมวมี 9 ชีวิต")

    st.header("7. ทำไมฝนถึงตกลงมาเป็นแมวเป็นหมา?")
    st.markdown("อาจฟังดูแปลก ๆ สำหรับคนไทย เพราะ rain cats and dogs เป็นสำนวนภาษาอังกฤษที่ใช้เพื่อบอกว่าฝนตกหนักมาก สำนวนนี้เกิดที่ประเทศอังกฤษในศตวรรษที่ 17 เพราะฝนตกจนน้ำท่วม หมาแมวจรจำนวนมากจึงถูกพัดไหลไปตามน้ำ บ้างก็เชื่อว่ามันมาจากคำว่า “catadupe” ซึ่งเป็นคำภาษาอิตาลีโบราณ แปลว่าน้ำตก")

    st.header("8. แมวร้องเมี้ยวแค่กับคนจริงไหม?")
    st.markdown("แมวเหมียวจะส่งเสียงต่าง ๆ เพื่อสื่อสารและบอกความต้องการของตนเอง ซึ่งการร้อง “เมี้ยว” พบได้บ่อยมาก ที่สำคัญมันเป็นเสียงที่แมวเหมียวใช้กับคนเท่านั้น! โดยจะใช้เพื่อทักทาย เรียกร้องความสนใจ บางครั้งก็เพื่อขอขนมหรือของเล่น ถ้าได้ยินเสียงร้องเมี้ยว ก็อย่าลืมหันไปสนใจพวกเค้ากันหน่อยนะ")

    st.header("9. ทำไมแมวชอบคาบเหยื่อมาให้?")
    st.markdown("แมวเหมียวทั้งน่ารักและซื่อสัตย์ พวกเค้าชอบแสดงความรักโดยการให้ของขวัญ แต่ด้วยสัญชาตญาณนักล่า ทำให้ของขวัญส่วนใหญ่เป็นสัตว์ขนาดเล็ก นอกจากเป็นการแสดงความรักของแมว พฤติกรรมนี้ก็บ่งบอกได้เจ้าเหมียวเห็นคุณเป็นลูกที่ต้องให้อาหาร หวังว่าข้อมูลแมวนี้จะช่วยให้คุณเบาใจขึ้นเมื่อต้องรับของขวัญจากเหมียว")

    st.header("10. ทำไมแมวถึงโด่งดังในโลกออนไลน์?")
    cat3 = st.image("cat3.png")
    st.markdown("สำหรับน้องแมว พฤติกรรมที่แสดงออกมาต่อหน้ากล้องนั้น ทั้งน่ารัก ตลก และเผยให้เห็นความเฉลียวฉลาด จึงไม่น่าแปลกใจเลยว่าทำไมทุกอย่างเกี่ยวกับแมวจึงกลายเป็นไวรัลทั่วโลกออนไลน์ จะหน้าตาหรือท่าทางก็เรียกรอยยิ้มและเสียงหัวเราะได้เสมอ ซึ่งมันจะเป็นแบบนี้อีกนานและอาจเป็นตลอดไปเลยด้วย!")

def cats2():
    import streamlit as st
    st.sidebar.success("คลิก ด้านบนเพื่อกลับหน้าแรก.")
    st.markdown(f'# {list(name.keys())[1]}')
    st.header("โรคผิวหนังแมวจากภูมิแพ้แมว")
    cat4 = st.image("cat4.png")
    st.write(
        """
        หากแมวเป็นภูมิแพ้ เราควรทำอย่างไร? บทความนี้มีคำตอบให้! อาการของโรคภูมิแพ้ในแมวพบได้หลายรูปแบบ 
        ตั้งแต่อาการระคายเคืองที่ผิวหนังไปจนถึงปัญหาในระบบทางเดินหายใจ ผู้เลี้ยงจึงจำเป็นต้องเรียนรู้ลักษณะอาการที่บ่งบอกถึงโรคนี้ 
        ว่าแล้วก็มาสำรวจปัจจัยที่ทำให้แมวเป็นภูมิแพ้ ประเภทของโรคภูมิแพ้ที่อาจพบได้บ่อย และวิธีดูแลรักษาอย่างเหมาะสมไปด้วยกัน
        - คลิกดูคลิปเพิ่มเติม. [คลิปเพิ่มเติม](https://www.youtube.com/watch?v=T3qLtaYKkuY)
"""
    )

    st.header("พฤติกรรมที่พบได้บ่อยเมื่อแมวโกรธ")
    cat5 = st.image("cat5.png")
    st.write(
        """
        แมวส่วนใหญ่อ่อนโยนและเป็นมิตร เจ้าเหมียวเหล่านี้มักจะแสดงความรักกับทาสแมวคนโปรดอยู่เสมอ
        แต่นอกจากมุมน่ารักอ่อนหวานแล้ว แมวยังมีนิสัยรักสันโดษ ชอบความเป็นส่วนตัว พวกเค้าอาจหลบไปพักอยู่ในมุมเงียบ ๆ 
        หลังจากเข้าสังคมมาทั้งวัน การบุกรุกพื้นที่ส่วนตัวอาจทำแมวโกรธ รู้สึกเครียดและวิตกกังวล 
        แมวบางตัวอาจแสดงพฤติกรรมก้าวร้าวออกมาด้วย
        - คลิกดูคลิปเพิ่มเติม. [คลิปเพิ่มเติม](https://www.youtube.com/watch?v=cxLt72AEZbs)
"""
    )

    
    st.header("วิธีอ่านภาษากายและท่าทางแมว")
    cat6 = st.image("cat6.png")
    st.write(
        """
        การสื่อสารถือเป็นหัวใจสำคัญในทุกความสัมพันธ์ เช่นเดียวกับแมวเหมียวที่คุณรัก 
        แต่เราจะทำความเข้าใจเจ้าตัวน้อยเหล่านี้ได้อย่างไร ในเมื่อพวกเค้าไม่สามารถพูดภาษาของเรา 
        ความลับก็คือท่าทางแมวบอกอารมณ์ได้นะ เราสามารถสังเกตดวงตา ใบหู ภาษากายหรือท่าทางของแมว 
        เพื่อทำความเข้าใจอารมณ์ความรู้สึกและสิ่งที่พวกเค้าต้องการจะบอกได้ โดยในบทความนี้ เราจะพาคุณดำดิ่งเข้าสู่โลกของภาษาแมว 
        พร้อมนำเสนอท่าทางที่พบบ่อยและความหมายของท่าทางเหล่านั้น
        - คลิกดูคลิปเพิ่มเติม. [คลิปเพิ่มเติม](https://www.youtube.com/watch?v=40JxWIMc4S0)
"""
    )

    
    st.header("ลักษณะของแมวแก่")
    cat7 = st.image("cat7.png")
    st.write(
        """
        ในช่วงวัยเด็กของเจ้าเหมียว พวกเค้ามอบช่วงเวลาแห่งความสุขและความสนุกให้คุณนับไม่ถ้วน
        แต่เมื่อมีอายุขึ้น ความต้องการและความชอบของแมวก็เปลี่ยนไป ในบทความนี้ เราจะพาคุณไปเรียนรู้วิธีสังเกตสัญญาณเตือนของความชราในแมว
         พร้อมแบ่งปันเคล็ดลับดี ๆ ในการเล่นและดูแลแมวแก่ของคุณ เพื่อให้แน่ใจว่าพวกเค้าจะมีความสุขและมีสุขภาพดี
         - คลิกดูคลิปเพิ่มเติม. [คลิปเพิ่มเติม](https://www.youtube.com/watch?v=cP78aizpt04)

"""
    )

def cats3():
    import streamlit as st
    st.sidebar.success("คลิก ด้านบนเพื่อกลับหน้าแรก.")
    st.markdown(f'# {list(name.keys())[2]}')
    cat8= st.image("cat8.png")
    st.write("ขนมเทมเทชันส์ รสเทสตี้ไก่")
    st.markdown(
        """ ***วิธีการให้ขนม***
        **สำหรับแมวโต สามารถให้ขนมแมวเทมเทชั่นส์ได้ 20 เม็ดต่อวัน
        สำหรับแมวเด็ก ควรให้ขนมแมวไม่เกิน 6 ชิ้นต่อวัน
        ถ้าให้ขนม สามารถปรับปริมาณการให้อาหารหลักในแต่ละวันได้ เก็บสินค้าให้ที่อุณหภูมิห้องและแห้ง**
        - ซื้อออนไลน์. [มีจำหน่ายที่นี่](https://shopee.co.th/scp/78896605/eyJjaWQiOjI1MzE0LCJzaWQiOjc4ODk1MTMxLCJpc0RyYWZ0IjpmYWxzZX0=?smtt=9&utm_campaign=s78895131_ss_th_othr_temptationsbrandwebsite&utm_content=ctabutton&utm_medium=seller&utm_source=brandwebsite)
        """
    )
    
    cat9= st.image("cat9.png")
    st.write("ขนมเทมชันส์ รสเทมติ้งทูน่า")
    st.markdown(
        """ ***วิธีเอาใจน้องแมวสุดที่รักอยู่ใช่มั้ย?***
        **นี่เลย! ขนมแมว เทมเทชันส์ อร่อย กรอบกว่าเดิม 
        ขนมเม็ดพ็อคเกตรสไก่แสนอร่อย กรอบนอก นุ่มใน สอดไส้ครีม
         รับรองว่าอร่อยเพลินเกินห้ามใจ ไม่ต้องกลัวอ้วน
          เม็ดละไม่เกิน 2 กิโลแคลอรี่เท่านั้น แต่สารอาหารครบถ้วน
        ลองเลย! เขย่าเดียว เหมียวมา!**
        - ซื้อออนไลน์. [มีจำหน่ายที่นี่](https://shopee.co.th/scp/78896605/eyJjaWQiOjI1MzE0LCJzaWQiOjc4ODk1MTMxLCJpc0RyYWZ0IjpmYWxzZX0=?smtt=9&utm_campaign=s78895131_ss_th_othr_temptationsbrandwebsite&utm_content=ctabutton&utm_medium=seller&utm_source=brandwebsite)
        """
    )

    cat10= st.image("cat10.png")
    st.write("ขนมเทชันส์ รสเซเวอรี่แซลมอน")
    st.markdown(
        """ ***ธีเอาใจน้องแมวสุดที่รักอยู่ใช่มั้ย?***
        **นี่เลย! ขนมแมว เทมเทชันส์ อร่อย กรอบกว่าเดิม 
        ขนมเม็ดพ็อคเกตรสไก่แสนอร่อย กรอบนอก นุ่มใน สอดไส้ครีม รับรองว่าอร่อยเพลินเกินห้ามใจ ไม่ต้องกลัวอ้วน 
        เม็ดละไม่เกิน 2 กิโลแคลอรี่เท่านั้น แต่สารอาหารครบถ้วน
        ลองเลย! เขย่าเดียว เหมียวมา**
        - ซื้อออนไลน์. [มีจำหน่ายที่นี่](https://shopee.co.th/scp/78896605/eyJjaWQiOjI1MzE0LCJzaWQiOjc4ODk1MTMxLCJpc0RyYWZ0IjpmYWxzZX0=?smtt=9&utm_campaign=s78895131_ss_th_othr_temptationsbrandwebsite&utm_content=ctabutton&utm_medium=seller&utm_source=brandwebsite)
        """
    )

    cat11= st.image("cat11.png")
    st.write("ขนมเทชั่นส์ รสซีฟู้ดเมดเล่ย์")
    st.markdown(
        """ ***วิธีการให้ขนม***
        **สำหรับแมวโต สามารถให้ขนมแมวเทมเทชั่นส์ได้ 20 เม็ดต่อวัน
        สำหรับแมวเด็ก ควรให้ขนมแมวไม่เกิน 6 ชิ้นต่อวัน
        ถ้าให้ขนม สามารถปรับปริมาณการให้อาหารหลักในแต่ละวันได้ เก็บสินค้าให้ที่อุณหภูมิห้องและแห้ง**
        - ซื้อออนไลน์. [มีจำหน่ายที่นี่](https://shopee.co.th/scp/78896605/eyJjaWQiOjI1MzE0LCJzaWQiOjc4ODk1MTMxLCJpc0RyYWZ0IjpmYWxzZX0=?smtt=9&utm_campaign=s78895131_ss_th_othr_temptationsbrandwebsite&utm_content=ctabutton&utm_medium=seller&utm_source=brandwebsite)
        """
    )

    cat12= st.image("cat12.png")
    st.write("ขนมเทชันส์ รสครีมมี่แดรี")
    st.markdown(
        """ ***ธีเอาใจน้องแมวสุดที่รักอยู่ใช่มั้ย?***
        **นี่เลย! ขนมแมว เทมเทชันส์ อร่อย กรอบกว่าเดิม 
        ขนมเม็ดพ็อคเกตรสไก่แสนอร่อย กรอบนอก นุ่มใน สอดไส้ครีม รับรองว่าอร่อยเพลินเกินห้ามใจ ไม่ต้องกลัวอ้วน
          เม็ดละไม่เกิน 2 กิโลแคลอรี่เท่านั้น แต่สารอาหารครบถ้วน
        ลองเลย! เขย่าเดียว เหมียวมา**
        - ซื้อออนไลน์. [มีจำหน่ายที่นี่](https://shopee.co.th/scp/78896605/eyJjaWQiOjI1MzE0LCJzaWQiOjc4ODk1MTMxLCJpc0RyYWZ0IjpmYWxzZX0=?smtt=9&utm_campaign=s78895131_ss_th_othr_temptationsbrandwebsite&utm_content=ctabutton&utm_medium=seller&utm_source=brandwebsite)
        """
    )


name = {
    "หน้าแรก": cats1,
    "การดูแลแมว": cats2,
    "อาหารแนะนำสำหรับน้องแมว": cats3
}
name2 = st.sidebar.selectbox("เลือกเพื่อดูเกี่ยวกับแมว", name.keys())
name[name2]()


